/**
 * @File: DDM.h
 * @Module: DDM头文件
 * @Author: zhengtao6@hikvision.com.cn
 * @Created: 2021年3月31日
 *
 * @Description: DDM头文件，对内被DDM实现代码引用，对外被上层应用程序应用
 *
 * @Note : DDM V2.0的头文件版本采用如下规则进行管理：
 *         主版本号.次版本号.修订号：X.Y.R
 *         主版本号(X):当进行重大框架性升级后，递增主版本号，次版本号和修订号归零；
 *         次版本号(Y):当对API进行了不能向前兼容的修改或删除后（如删除子模块或修改IOCTL命令），递增次版本号，修订号归零；
 *         修订号  (R):当对API进行了能向前兼容的修改或新增后（如新增子模块或新增IOCTL命令），递增修订号
 *
 *         原则上，DDM V2.0的头文件只允许新增接口，不允许删除或修改已有的接口。
 *
 * @Usage:
 *
 */

#ifndef INCLUDE_DDM_H_
#define INCLUDE_DDM_H_

#define DDM_HEADER_VERSION                  2
#define DDM_HEADER_PATCHLEVEL               1
#define DDM_HEADER_SUBLEVEL                 2

#define DDM_VERSION(v,p,s)                  (((v) << 16) + ((p) << 8) + (s))

/****************************** 通用宏定义 ******************************/
//电源管理模式
typedef enum
{
    DDM_PM_NORMAL= 0,                   // 正常工作模式
    DDM_PM_LOWPOWER,                    // 低功耗模式
    DDM_PM_POWEROFF,                    // 关闭电源模式
    DDM_PM_MAX,                         // 最大值
} DDM_PmMode;

/*********************************************************************
 ******************************* DDM_ble ******************************
 *********************************************************************/

/******************************* 宏定义 ******************************/
#define DDM_DEV_TTY_BLE_NAME            "/dev/DDM/tty_ble"
#define DDM_DEV_BLE_NAME                "/dev/DDM/ble"
#define DDM_IOC_BLE_MNUM                'B'
//下载蓝牙固件，仅限SPI接口蓝牙使用
#define DDM_IOC_BLE_UPDATE_FW           _IOW(DDM_IOC_BLE_MNUM, 0, DDM_bleSetFwArgs)
// 清除接收缓存，仅限spi接口蓝牙使用
#define DDM_IOC_BLE_CLEAR_RXBUFFER      _IO(DDM_IOC_BLE_MNUM, 1)
// 蓝牙异常复位接口（预留接口，暂不使用）
#define DDM_IOC_BLE_RESET_CHIP          _IO(DDM_IOC_BLE_MNUM, 2)
// 蓝牙固件升级前时序环境准备（包括上电复位等逻辑）仅串口接口蓝牙模块调用
#define DDM_IOC_BLE_PREPARE_UPDATE      _IO(DDM_IOC_BLE_MNUM, 3)
// 蓝牙模块电源管理模式设置
#define DDM_IOC_BLE_SET_POWER           _IOW(DDM_IOC_BLE_MNUM, 4, DDM_PmMode)
// 获取蓝牙接口类型
#define DDM_IOC_BLE_GET_INFTYPE         _IOR(DDM_IOC_BLE_MNUM, 5, DDM_bleGetInftype)


/******************************* 数据结构 ******************************/
// 固件升级参数
typedef struct tagDDM_bleSetFwArgs
{
    char fw_path[100];                  // 固件路径
    int reserve;                        // 保留
} DDM_bleSetFwArgs;

// 蓝牙接口类型
typedef enum
{
    DDM_BLE_INFTYPE_SPI= 0,             // SPI接口类型
    DDM_BLE_INFTYPE_TTY,                // 串口接口类型
    DDM_BLE_INFTYPE_MAX,                // 最大值 必须为最后一个
} DDM_bleGetInftype;

/*********************************************************************
 ******************************* DDM_display ******************************
 *********************************************************************/

/******************************* 宏定义 ******************************/
#define DDM_DEV_DISPLAY_NAME            "/dev/DDM/display"
#define DDM_IOC_DISPLAY_MNUM            'D'
//设置显示屏背光亮度,有效值1-100
#define DDM_IOC_DISPLAY_SET_BRIGHTNESS  _IOW(DDM_IOC_DISPLAY_MNUM, 0, unsigned int)
//开关显示屏电源
#define DDM_IOC_DISPLAY_SET_POWER       _IOW(DDM_IOC_DISPLAY_MNUM, 1, DDM_PmMode)
//获取显示屏ID
#define DDM_IOC_DISPLAY_GET_LCDID       _IOR(DDM_IOC_DISPLAY_MNUM, 2, int)
/******************************* 数据结构 ******************************/

/*********************************************************************
 ******************************* DDM_exio ******************************
 *********************************************************************/
/******************************* 宏定义 ******************************/
#define DDM_DEV_EXIO_NAME               "/dev/DDM/exio"
#define DDM_IOC_EXIO_MNUM               'E'
//获取EXIO通道数
#define DDM_IOC_EXIO_GET_NUM            _IOR(DDM_IOC_EXIO_MNUM, 0, DDM_exioGetNum)
//获取GPIO类输入通道状态
#define DDM_IOC_EXIO_GET_INPUT          _IOR(DDM_IOC_EXIO_MNUM, 1, unsigned int)
//设置GPIO类输出通道状态
#define DDM_IOC_EXIO_SET_OUTPUT         _IOW(DDM_IOC_EXIO_MNUM, 2, DDM_exioSetValue)
//设置继电器输出通道状态
#define DDM_IOC_EXIO_SET_RELAY          _IOW(DDM_IOC_EXIO_MNUM, 3, DDM_exioSetValue)
//获取防拆状态
#define DDM_IOC_EXIO_GET_TAMPER         _IOR(DDM_IOC_EXIO_MNUM, 4, unsigned int)
//获取报警输入状态
#define DDM_IOC_EXIO_GET_ALARM          _IOR(DDM_IOC_EXIO_MNUM, 5, DDM_exioGetAlarm)
//设置报警输出状态
#define DDM_IOC_EXIO_SET_ALARM          _IOW(DDM_IOC_EXIO_MNUM, 6, DDM_exioSetAlarm)
//获取门磁输入状态
#define DDM_IOC_EXIO_GET_DOORSENSOR     _IOR(DDM_IOC_EXIO_MNUM, 7, DDM_exioGetDoorSensor)
//设置门锁输出状态
#define DDM_IOC_EXIO_SET_DOORSENSOR     _IOW(DDM_IOC_EXIO_MNUM, 8, DDM_exioSetDoorSensor)
//获取开门按钮输入状态
#define DDM_IOC_EXIO_GET_DOORKEY        _IOR(DDM_IOC_EXIO_MNUM, 9, DDM_exioGetDoorKey)
//设置钱箱输出状态
#define DDM_IOC_EXIO_SET_CASHBOX        _IOW(DDM_IOC_EXIO_MNUM, 10, DDM_exioSetCashBox)
//获取消防输入状态
#define DDM_IOC_EXIO_GET_FIREFIGHTING   _IOW(DDM_IOC_EXIO_MNUM, 11, DDM_exioGetFireFighting)
/******************************* 数据结构 ******************************/
typedef struct
{
    unsigned int innum;                 // GPIO类输入通道数量
    unsigned int outnum;                // GPIO类输出通道数量
    unsigned int relaynum;              // 继电器输出通道数量
    unsigned int reserve[5];            // 保留
} DDM_exioGetNum;

typedef struct
{
    unsigned char ch;                   // 设置的通道编号
    unsigned char value;                // 设置的值
    unsigned char reserve[2];           // 保留
} DDM_exioSetValue;

typedef struct
{
    unsigned char index;                // 索引编号,从0开始,默认保持与丝印对应,即0对应报警输入1的io
    unsigned char level;                // 索引编号对应io的电平值
} DDM_exioGetLevel;

typedef struct
{
    unsigned char index;                // 索引编号,从0开始,默认保持与丝印对应,即0对应报警输出1的io
    unsigned char level;                // 索引编号对应io的电平值
    unsigned char flag;                 // 0表示忽略对应index操作,1表示设置对应index的电平值为level
    unsigned char reserve[1];           // 预留
} DDM_exioSetLevel;

typedef struct {
    int number;                         // 硬件层面指出的最大输入路数,bsp上传上来的
    DDM_exioGetLevel in[16];            // 最大支持16路输入
} DDM_exioGetAlarm;

typedef struct {
    int number;                         // 硬件层面指出的最大输出路数,bsp上传上来的
    DDM_exioSetLevel out[16];           // 最大支持16路报警输出
} DDM_exioSetAlarm;

typedef struct {
    int number;                         // 硬件层面指出的最大输入路数,bsp上传上来的
    DDM_exioGetLevel in[4];             // 最大支持4路输入
} DDM_exioGetDoorSensor;

typedef struct {
    int number;                         // 硬件层面指出的最大输出路数,bsp上传上来的
    DDM_exioSetLevel out[4];            // 最大支持4路输入
} DDM_exioSetDoorSensor;

typedef struct {
    int number;                         // 硬件层面指出的最大输出路数,bsp上传上来的
    DDM_exioSetLevel out[4];            // 最大支持4路输入
} DDM_exioSetCashBox;

typedef struct {
    int number;                         // 硬件层面指出的最大输入路数,bsp上传上来的
    DDM_exioGetLevel in[4];             // 最大支持4路输入
} DDM_exioGetDoorKey;

typedef struct {
    int number;                         // 硬件层面指出的最大输入路数,bsp上传上来的
    DDM_exioGetLevel in[4];             // 最大支持4路输入
} DDM_exioGetFireFighting;

/*********************************************************************
 ******************************* DDM_fan ******************************
 *********************************************************************/

/******************************* 宏定义 ******************************/
#define DDM_DEV_FAN_NAME                "/dev/DDM/fan"
#define DDM_IOC_FAN_MNUM                'F'
//设置风扇转速(0-100)
#define DDM_IOC_FAN_SET_VAL             _IOW(DDM_IOC_FAN_MNUM, 0, unsigned char)

/******************************* 数据结构 ******************************/

/*********************************************************************
 ******************************* DDM_fingerprint ******************************
 *********************************************************************/

/******************************* 宏定义 ******************************/
//对于串口方案的fingerprint模块，APP通过如下标准串口节点与fingerprint模块进行数据交互
#define DDM_DEV_TTY_FINGERPRINT_NAME    "/dev/DDM/tty_fingerprint"
#define DDM_DEV_FINGERPRINT_NAME        "/dev/DDM/fingerprint"
#define DDM_IOC_FINGERPRINT_MNUM        'F'
// 芯片复位<仅针对TTY方案>
#define DDM_IOC_FINGERPRINT_RESET_CHIP      _IO(DDM_IOC_FINGERPRINT_MNUM, 0)
// 获取图像大小信息
#define DDM_IOC_FINGERPRINT_GET_IMAGE_SIZE  _IOR(DDM_IOC_FINGERPRINT_MNUM, 1, DDM_fingerprintGetSize)
// 直接获取图像
#define DDM_IOC_FINGERPRINT_GET_IMAGE_DATA  _IOR(DDM_IOC_FINGERPRINT_MNUM, 2, DDM_fingerprintGetImage)
/******************************* 数据结构 ******************************/
typedef struct
{
    unsigned int        width;          // 指纹图像长度
    unsigned int        height;         // 指纹图像宽度
    unsigned int        image_size;     // 指纹图像大小
    unsigned char       bit_width;      // 指纹图像位深
    unsigned char       res[3];         // 保留
} DDM_fingerprintGetSize;

typedef struct
{
    unsigned char   finger_status;      // 手指检测状态
    unsigned char   *data;              // 指纹图像数据
    unsigned char   res[6];             // 保留
} DDM_fingerprintGetImage;


/*********************************************************************
 ******************************* DDM_gprs ******************************
 *********************************************************************/

/******************************* 宏定义 ******************************/
// gprs模块电源与复位控制通道
#define DDM_DEV_GPRS_NAME               "/dev/DDM/gprs"
// gprs模块串口AT指令通道
#define DDM_DEV_TTY_GPRS_NAME           "/dev/DDM/tty_gprs"
#define DDM_IOC_GPRS_MNUM               'G'

// gprs异常硬件复位(预留)
#define DDM_IOC_GPRS_RESET_CHIP         _IO(DDM_IOC_GPRS_MNUM, 0)
// gprs低功耗设置
#define DDM_IOC_GPRS_SET_POWER          _IOW(DDM_IOC_GPRS_MNUM, 1, DDM_PmMode)

/******************************* 数据结构 ******************************/


/*********************************************************************
 ******************************* DDM_icr ******************************
 *********************************************************************/

/******************************* 宏定义 ******************************/
#define DDM_DEV_ICR_NAME                "/dev/DDM/icr"
#define DDM_IOC_ICR_MNUM                'I'
//获取ICR 当前状态
#define DDM_IOC_ICR_GET_STATE           _IOR(DDM_IOC_ICR_MNUM, 0, unsigned int)
//设置ICR 状态
#define DDM_IOC_ICR_SET_STATE           _IOW(DDM_IOC_ICR_MNUM, 1, unsigned int)

/******************************* 数据结构 ******************************/
//ICR 状态
typedef enum
{
    DDM_ICR_STATE_DAY,                  // DDM_ICRSTATE_DAY  白天
    DDM_ICR_STATE_NIGHT,                // DDM_ICRSTATE_NIGHT 夜晚
    DDM_ICR_STATE_MAX,
} DDM_icrState;

/*********************************************************************
 ******************************* DDM_info *****************************
 *********************************************************************/

/******************************* 宏定义 ******************************/
#define DDM_DEV_INFO_NAME               "/dev/DDM/info"
#define DDM_IOC_INFO_MNUM               'I'
// 写入v2.0版本加密产品信息(仅加密模式下提供)
#define DDM_IOC_INFO_WRITE_PRODUCT_INFO _IOW(DDM_IOC_INFO_MNUM, 0, BOOT_PARAMS_V20)
// 读取v2.0版本加密产品信息
#define DDM_IOC_INFO_READ_PRODUCT_INFO  _IOR(DDM_IOC_INFO_MNUM, 1, BOOT_PARAMS_V20)
// 写入HDB信息(仅加密模式下提供)
#define DDM_IOC_INFO_WRITE_HARDWRE_INFO _IOW(DDM_IOC_INFO_MNUM, 2, hdb_info)
// 读取HDB信息
#define DDM_IOC_INFO_READ_HARDWRE_INFO  _IOR(DDM_IOC_INFO_MNUM, 3, hdb_info)
// 获取密钥状态
#define DDM_IOC_INFO_READ_KEYSTATE      _IOR(DDM_IOC_INFO_MNUM, 4, DDM_infoKey)
// 写入密钥(仅加密模式下提供)
#define DDM_IOC_INFO_WRITE_KEY          _IOW(DDM_IOC_INFO_MNUM, 5, DDM_infoKey)
// 读取密钥
#define DDM_IOC_INFO_READ_KEY           _IOR(DDM_IOC_INFO_MNUM, 6, DDM_infoKey)
// 写入摄像头标定信息
#define DDM_IOC_INFO_WRITE_CAMPARA      _IOW(DDM_IOC_INFO_MNUM, 7, DDM_infoCamInfo)
// 读取摄像头标定信息
#define DDM_IOC_INFO_READ_CAMPARA       _IOR(DDM_IOC_INFO_MNUM, 8, DDM_infoCamInfo)
// 写入app根密钥信息(仅加密模式下提供,针对假的、保存在flash中的根密钥操作,app不需要使用)
#define DDM_IOC_INFO_WRITE_ROOTKEY      _IOW(DDM_IOC_INFO_MNUM, 9, DDM_infoRootkeyInfo)
// 读取app根密钥信息(针对假的、保存在flash中的根密钥操作,app不需要使用)
#define DDM_IOC_INFO_READ_ROOTKEY       _IOR(DDM_IOC_INFO_MNUM, 10, DDM_infoRootkeyInfo)
// 写入测温模块标定信息
#define DDM_IOC_INFO_WRITE_TEMPPARA     _IOW(DDM_IOC_INFO_MNUM, 11, DDM_infoTempInfo)
// 读取测温模块标定信息
#define DDM_IOC_INFO_READ_TEMPPARA      _IOR(DDM_IOC_INFO_MNUM, 12, DDM_infoTempInfo)
// 写萤石DeviceID相关信息
#define DDM_IOC_INFO_WRITE_EZVIZINFO    _IOW(DDM_IOC_INFO_MNUM, 13, DDM_infoEzvizInfo)
// 读萤石DeviceID相关信息
#define DDM_IOC_INFO_READ_EZVIZINFO     _IOR(DDM_IOC_INFO_MNUM, 14, DDM_infoEzvizInfo)
// 写TOF标定信息
#define DDM_IOC_INFO_WRITE_TOFPARA      _IOW(DDM_IOC_INFO_MNUM, 15, DDM_infoTofInfo)
// 读TOF标定信息
#define DDM_IOC_INFO_READ_TOFPARA       _IOR(DDM_IOC_INFO_MNUM, 16, DDM_infoTofInfo)
// 读取DDM版本信息
#define DDM_IOC_INFO_GET_VERSION        _IOR(DDM_IOC_INFO_MNUM, 17, DDM_infoGetVersion)
// 写身份证秘钥信息
#define DDM_IOC_INFO_WRITE_IDKEY        _IOW(DDM_IOC_INFO_MNUM, 18, DDM_infoIdkeyInfo)
// 读身份证秘钥信息
#define DDM_IOC_INFO_READ_IDKEY         _IOR(DDM_IOC_INFO_MNUM, 19, DDM_infoIdkeyInfo)
// 存入设备参数信息
#define DDM_IOC_INFO_WRITE_CALIB        _IOR(DDM_IOC_INFO_MNUM, 20, DDM_infoVlaueCalib)
// 读取设备参数信息
#define DDM_IOC_INFO_READ_CALIB         _IOR(DDM_IOC_INFO_MNUM, 21, DDM_infoVlaueCalib)
//写HEOP分区大小信息
#define DDM_IOC_INFO_WRITE_HEOP_PARA	_IOW(DDM_IOC_INFO_MNUM, 22, DDM_heopPara)
//读HEOP分区大小信息
#define DDM_IOC_INFO_READ_HEOP_PARA		_IOR(DDM_IOC_INFO_MNUM, 23, DDM_heopPara)

#ifndef HDB_MAGIC
#define HKVS_MAGIC  0x53564b48          //HKVS
#define SVKH_MAGIC  0x484b5653          //SVKH
#endif

#ifndef CFG_MAGIC
#define CFG_MAGIC   0x484b5753          //HKWS
#endif
/******************************* 数据结构 ******************************/
typedef enum
{
    DDM_INFO_STATE_UNWRITE  = 0,        // 信息未写入
    DDM_INFO_STATE_WRITEED  = 1,        // 信息已写入
    DDM_INFO_STATE_ERROR    = 2,        // 信息错误(损坏情况、预留)
    DDM_INFO_STATE_MAX,
} DDM_infoKeyState;

typedef enum
{
    DDM_INFO_TYPE_BOOTKEY   = 0,        // 启动密钥,长度32字节
    DDM_INFO_TYPE_ALGKEY    = 1,        // 算法密钥,长度32字节
    DDM_INFO_TYPE_ROOTKEY   = 2,        // 设备数据存储根密钥,长度32字节
    DDM_INFO_TYPE_AUTHKEY   = 3,        // 认证密钥或者数字签名,长度32字节
    DDM_INFO_TYPE_APPKEY    = 4,        // 应用程序密钥(预留)
    DDM_INFO_TYPE_MAX,
} DDM_infoKeyType;

typedef struct
{
    DDM_infoKeyType  type;              // 密钥类型 参考DDM_infoKeyType
    DDM_infoKeyState state;             // 密钥状态 参考DDM_infoKeyState
    unsigned char    data[32];          // 数据,最大长度为32字节
    unsigned int     len;               // 数据长度
} DDM_infoKey;

typedef struct
{
    unsigned int    data_len;           // 数据长度,最大支持4KB长度
    void *          data;               // 数据
} DDM_infoVlaue;

typedef struct {
	unsigned int    crc;    		//!<  校验值CRC32
    unsigned int    flags;			//!<  分区划分配置状态 
    unsigned int    config_size;    //!<  config分区大小 MB
    unsigned int    heop_size;		//!<  heop分区大小	MB
    unsigned int    emmc_size;		//!<  emmc容量大小	MB
	unsigned int	res;          	//!<  预留
} DDM_heopPara;

typedef DDM_infoVlaue DDM_infoCamInfo;
typedef DDM_infoVlaue DDM_infoRootkeyInfo;
typedef DDM_infoVlaue DDM_infoTempInfo;
typedef DDM_infoVlaue DDM_infoEzvizInfo;
typedef DDM_infoVlaue DDM_infoTofInfo;
typedef DDM_infoVlaue DDM_infoIdkeyInfo;

typedef struct
{
	unsigned int        index; 				// 标定信息类型对应的索引值
	unsigned int		calib_checksum; 	// 标定信息有效数据和校验
    unsigned int   	 	data_len;           // 标定信息有效数据长度,最大支持256KB长度,单位字节
    void *          	data;               // 标定信息有效数据
} DDM_infoVlaueCalib;

typedef struct
{
    unsigned char    major;             // 主版本号
    unsigned char    minor;             // 子版本号
    unsigned char    revision;          // 修订号
    unsigned char    rev[1];            // 预留
} DDM_infoGetVersion;

/* 使用预留字段时，保证4字节对齐 */
typedef struct
{
    /*结构体头 共16字节*/
    unsigned int    magic_number;               //0 幻数  有效值0x484b5753
    unsigned int    para_checksum;              //4 结构体校验和
    unsigned int    para_length;                //8 结构长度  ，长度从'encryptVer'开始计算
    unsigned int    encrypt_ver;                //12 加密版本:用于控制此结构的更改 当前是0x00020000(V20)

    /*设备基本信息  共256字节*/
    unsigned char   language[16];               /*16 各个位对应的语言，1表示支持，0表示不支持，可以多种组合
bit0：英语 bit1：简体中文 bit2：繁体中文 bit3：日语 bit4：朝鲜语 bit5：印度语 bit6：蒙古语 bit7：越南 bit8：马来文 bit9：泰国
bit10：菲律宾 bit11：印尼文 bit12：孟加拉文 bit13：老挝文 bit14：尼泊尔文 bit15：丹麦文 bit16：乌克兰文 bit17：乌茲别克语 bit18：亚美尼亚语 bit19：俄语
bit20：保加利亚文 bit21：克罗地亚文 bit22：冰岛语 bit23：加泰罗尼亚文 bit24：匈牙利语 bit25：吉尔吉斯语 bit26：土库曼语 bit27：土耳其文 bit28：塞尔维亚文 bit29：塞索托语
bit30：希伯来语 bit31：希腊语 bit32：德语 bit33：意大利语 bit34：意第绪语 bit35：拉丁文 bit36：拉脱维亚语 bit37：挪威文 bit38：捷克语 bit39：斯洛伐克文
bit40：法语 bit41：波兰语 bit42：波斯语 bit43：爱尔兰语 bit44：爱沙尼亚语 bit45：瑞典语 bit46：瓜拉尼语 bit47：立陶宛语 bit48：索马里语 bit49：罗马尼亚语
bit50：芬兰语 bit51：荷兰语 bit52：葡萄牙语 bit53：西班牙语 bit54：阿尔巴尼亚文 bit55：阿拉伯文 bit56：马其顿文 bit57：马耳他文*/
    unsigned int    device_update_type;         //32 设备升级类型，门禁：850-999；对讲：1000-1200，升级包校验时用
    unsigned int    device_sdk_type;            //36 设备网络类型，门禁：850-899 10501-11000 对讲：602-700 11001-11500 ,返回给SDK使用
    unsigned int    device_sadp_type;           //40 设备SADP类型,门禁:目前维护:0xd0000-0xdffff 对讲：0xe000-0xe3ff
    unsigned int    mcu_device_update_type;     //44 mcu的设备类型，用于mcu升级校验，范围跟device_update_type一样
    unsigned char   dev_model[64];              //48 产品自定义型号 字符串
    unsigned int    oem_code;                   //112 0-无效，1-海康，2-中性 ，预留当前未实际使用
    unsigned char   prod_date[8];               //116 设备生产日期 年月日（4位年份+2位月份+2位日）
    unsigned char   prod_no[16];                //124 设备序列号，数字+字母  扩充到16 ，目前仅用9位
    unsigned char   random_code[6];             //140 萤石随机码
    unsigned char   platform_type;              //146 硬件平台，类型有AI2,AI3等平台代号，加密工具根据该字段从服务器上获取相应平台的加密资源
    unsigned char   sale_type;                       //147 销售类型  1:经销，2:行业
    unsigned int    person_num;                      //148 人员数量 0:表示无效
    unsigned int    face_num;                        //152 人脸数量 0:表示无效
    unsigned int    card_num;                        //156 卡片数量 0:表示无效
    unsigned int    finger_num;                      //160 指纹数量 0:表示无效
    unsigned int    iris_num;                        //164 虹膜数量 0:表示无效
    unsigned int    voice_num;                       //168 声纹数量 0:表示无效
    unsigned int    sale_area;                       //172 销售区域（不同地区的行业规范存在差异） 0:表示无效 
                                                            //28:安提瓜和巴布达 32：阿根廷 44:巴哈马 52:巴巴多斯 56:比利时 68:玻利维亚 76:巴西 84:伯利兹 92:英属维尔京群岛 100:保加利亚
                                                            //152:智利 170: 哥伦比亚 188:哥斯答黎加 191:克罗地亚
                                                            //203:捷克 208:丹麦 212:多米尼克 214:多米尼加共和国 218：厄瓜多尔 222:萨尔瓦多233:爱沙尼亚 250：法国 254:法属圭亚那 276:德国 
                                                            //300:希腊 308:格林纳达 320:危地马拉 328:圭亚那 332:海地 340:洪都拉斯 348:匈牙利 376:以色列 380:意大利 388:牙买加
                                                            //440:立陶宛 484:墨西哥
                                                            //642:罗马尼亚
                                                            //528:荷兰 558:尼加拉瓜 578:挪威 591:巴拿马
                                                            //600:巴拉圭 604:秘鲁 618:波兰 620:葡萄牙 643:俄罗斯 662:圣卢西亚 666:圣文森特和格林纳丁斯 659:圣基茨和尼维斯
                                                            //703:斯洛伐克 705:斯洛文尼亚 724：西班牙 740:苏里南 752:瑞典 780:特立尼达/多巴哥 792:土耳其
                                                            //804:乌克兰 826:英国 858:乌拉圭 862:委内瑞拉 891:塞尔维亚
	unsigned char	access_code[16];			//176 访问码（HD二线制门口机&室内机等项目使用，用于设备即插即用自动激活）
	unsigned char   res1[80];                   //192 设备基本信息预留字段

    /*算法校验信息  共128字节*/
    unsigned int    encrypt_alg_dev_class;      //272 用于研究院算法校验字段，默认和deviceUpdateType相等
    unsigned char   encrypt_algorithm;          //276 是否支持研究院算法（确认）加密：0不支持 1支持，加密工具需要通过该字段进行研究院算法加密流程
    unsigned char   self_algorithm;             //277 是否支持业务部算法加密：0不支持 1支持，加密工具需要通过该字段进行算法加密流程
    unsigned char   self_algo_auth[32];         //278 业务部算法认证密钥,后续指纹算法库内部直接通过这个字段认证，应用无需感知，目前实际使用16字节预留16字节
    unsigned char   crypto;                     //310 设备是否进行过加密 1：是，0：否 ，防止设备出厂再加密的情况。
    unsigned char   res2[89];                   //311 算法校验信息预留字段

    /*DSP相关能力 共128字节*/
    unsigned int    dsp_mem;                    //400 DSP使用的内存大小，单位MB，BSP用于分配DSP内存
    unsigned char   encode_chans;               //404 编码路数，SDK/ISAPI协议中，返回的通道个数，使用的是该值
    unsigned char   decode_chans;               //405 解码路数
    unsigned char   vo_nums;                    //406 支持vo个数: 0,1,2
    unsigned char   res3[121];                  //407 DSP相关能力预留字段

    /*硬件信息，用于定义CPLD中无法描述或者确认的硬件信息，作为CPLD硬件信息的补充  共128字节*/
    unsigned int    display_lcd_type;           //528 显示屏类型：0 - 三目宝(213&211)/利尔达(214&215)/广泰(233)； 1 - 视安通(313)，虚拟物料，产线根据不同批次使用不同的屏幕类型，bsp做相应的设置（1个字节就够了，0或者0xff表示无效值）
    unsigned char   net_num;                    //532 网口数 最大4路
    unsigned char   mac_addr[4][6];             //533 设备mac地址
    unsigned char   id_set_enable;              //557 身份证设置使能位（调制解调器使能位） 0-失能 1-使能， 当整机的身份读卡器刷卡无效时，可能使能该标志位，设置相应的rfcfgReg，gsnonReg，cwgspReg，modgspReg寄存器值，应用可以获取该值，配置给读卡器，是读卡器正常工作
    unsigned char   rfcfg_reg;                  //558 身份证读卡器寄存器26 （0x00~0x3F）
    unsigned char   gsnon_reg;                  //559 身份证读卡器寄存器27 （0x00~0x3F）
    unsigned char   cwgsp_reg;                  //560 身份证读卡器寄存器28 （0x00~0x3F）
    unsigned char   modgsp_reg;                 //561 身份证读卡器寄存器29 （0x00~0x3F）
    unsigned char   res4[94];                   //562 硬件信息预留字段

    /* 预留 */
    unsigned char   device_whole_name[128];         //656 ，设备整机命名,目前仅通道产品使用,如通道设备型号为DS-K3M204-S,组装完的通道命名为DS-K3B961TX-L/EPiQL-Dp60,通道产品通过该字段解析产品出厂时的装配信息。
    unsigned char   res5[240];                      //784 ，预留字节，其他分类预留不够时使用该预留空间共1024个字节

}BOOT_PARAMS_V20;

#pragma pack (4)                        //设置在内存中按照4字节对齐
typedef struct {
    unsigned char    major;             //主版本号
    unsigned char    minor;             //次版本号
    unsigned char    revision;          //修订号
    unsigned char    res[1];
} version_t;

typedef struct {
    unsigned char    year;              //年 默认前置20,如数值为19表示2019年
    unsigned char    month;             //月
    unsigned char    day;               //日
    unsigned char    res[5];
} date_t;

typedef struct {
    unsigned char    major;             //主版本号
    unsigned char    minor;             //次版本号
    unsigned char    revision;          //修订号
    unsigned char    res[1];
} board_t;

typedef struct {
    unsigned char    volume;            //主SOC外置DDR总容量 0-0MB,1-8MB,2-16MB,3-32MB,4-64MB,5-128MB,6-256MB,7-512MB,8-1GB,9-2GB,10-4GB,11-8GB
    unsigned char    num;               //主SOC外置DDR数量   0-无,1-1片外置,2-2片外置,4-4片外置,6-6片外置,8-8片外置
    unsigned char    res[6];
} ddr_t;

typedef struct {
    unsigned char    spk_func;          //spk功能 0-无,1-SPK1对讲,2-SPK1对讲+SPK2广播高音+SPK3广播低音
    unsigned char    mic_func;          //mic功能 0-无,1-MIC1对讲
    unsigned char    aec;               //是否硬件消回音 0-无,1-是
    unsigned char    res[5];
} audio_t;

typedef struct {
    unsigned char    type;              //摄像头类型 0-无,1-可见光,2-红外,3-虹膜,4-TOF,5-结构光,6-热成像
    unsigned char    chip;              /*摄像头芯片
                                          0-无,1-OS02K10 200W,2-OS02D10 200W,3-IMX307 200W,4-OS05A20 500W,5-MN34422 200W,6-OPN8008
                                        */
    unsigned char    rotation;          //摄像头旋转角度 0-0,1-90°,2-180°,3-270° 旋转方向为顺时针方向
    unsigned char    cam_lens;          /*镜头类型
                                          0-无效
                                          1-STF28S5F
                                          2-STF04Y5F
                                          3-STP37S1F
                                          4-STF04P6F
                                          5-STF28S5F_3MPIR
                                          6-STF04Y5F_3MPIR
                                          7-STF02S1F_2MPIR
                                          8-ACS-STF15SY1F-5MP
                                        */
    unsigned char    res[8];
} sensor_t;
typedef struct {
    unsigned char    resolution;        /*显示屏分辨率
                                          0-无,
                                          1-240*320,
                                          2-320*480,
                                          3-480*272,
                                          4-480*800,
                                          5-640*480,
                                          6-600*1024,
                                          7-1024*600,
                                          8-800*1280,
                                          9-1280*800,
                                          10-1366*768,
                                          11-1920*1080
                                        */
    unsigned char    rotation;          //显示屏旋转角度 0-0°,1-90°,2-180°,3-270° 旋转方向为顺时针方向
    unsigned char    touchscreen;       //触摸屏 0-无,1-有 正视图触摸屏原点坐标为左上角(x0,y0)
    unsigned char    size;              //实际尺寸 * 10，最大支持25.5寸(对应255)
    unsigned char    res[4];
} lcd_t;

typedef struct {
    unsigned char    rf1356;            //13.56M RF芯片 0-无,1-有
    unsigned char    rf125k;            //125K RF芯片   0-无,1-有
    unsigned char    wifi_module;       //WIFI模组      0-无,1-有
    unsigned char    wifi_probe;        //WIFI探针      0-无,1-有
    unsigned char    bluetooth;         //蓝牙芯片      0-无,1-有
    unsigned char    mcm;               //移动通信模组(mobile communication module) 0-无,1-有
    unsigned char    sub1g;             //Sub1G RF芯片  0-无,1-有
    unsigned char    zigbee;            //ZigBee芯片    0-无,1-有
    unsigned char    gps;               //定位模块      0-无,1-有
    unsigned char    res[7];
} wireless_t;

typedef struct {
    unsigned char    out_num;           //整机IO类输出接口的总数(三极管对外电平控制,xxx数值表示个数)
    unsigned char    in_num;            //整机IO类输入接口的总数(报警输入,门磁,开门按钮,xxx数值表示个数)
    unsigned char    relay_num;         //继电器输出总数(报警,门锁)
    unsigned char    res[5];
} exio_t;

typedef struct {
    /* 0x000 */ unsigned int     magic;             //魔幻数 HKVS
    /* 0x004 */ unsigned int     checksum;          //结构体CRC校验和,预留暂不用
    /* 0x008 */ version_t        version;           //结构体版本信息
    /* 0x00C */ date_t           date;              //结构体制作日期

    /* 0x014 */ unsigned int     pcb;               //板子的pcb号
    /* 0x018 */ board_t          board_attr;        //主板型号 硬件的版本1.0.A 1.1.B的定义

    /* 0x01C */ unsigned char    res1[4];

    /* 0x020 */ ddr_t            ddr_attr;          //内存信息
    /* 0x028 */ audio_t          audio_attr;        //音频信息
    /* 0x030 */ unsigned int     sensor_num;        //sensor个数   最大支持4个
    /* 0x034 */ sensor_t         sensor_attr[4];    //sensor信息
    /* 0x064 */ lcd_t            main_lcd;          //主屏信息
    /* 0x06C */ lcd_t            secondary_lcd;     //副屏信息
    /* 0x074 */ unsigned int     external_interface;//外接显示器的接口 0-无,1-HDMI,2-VGA,3-HDMI+VGA
    /* 0x078 */ unsigned char    res2[24];

    /* 0x090 */ unsigned int     se_type;           //加密芯片类型 0-无,1-CPU卡认证,2-Desfire认证,3-CPU卡认证+Desfire认证
    /* 0x094 */ wireless_t       wireless_attr;     //无线外设信息
    /* 0x0A4 */ exio_t           exio_attr;         //整机对外输入输出IO信息
    /* 0x0AC */ unsigned char    net_num;           //有线网络个数 0-10
    /* 0x0AD */ unsigned char    usb_num;           //USB个数      0-10
    /* 0x0AE */ unsigned char    rs485_num;         //RS485个数    0-10
    /* 0x0AF */ unsigned char    rs232_num;         //RS232个数    0-10
    /* 0x0B0 */ unsigned char    wiegand_num;       //韦根个数     0-10
	/* 0x0B1 */ unsigned char    sata_num;          //sata个数 0-10
	/* 0x0B2 */ unsigned char    phy_speed;         //网卡类型，用于识别10M 100M 1000M,应用配置协商速率 0-10M 1-100M 2-1000M
    /* 0x0B3 */ unsigned char    res3[13];

    /* 0x0C0 */ unsigned char    board_temp;        //主板温度传感器 0-无,1-有
    /* 0x0C1 */ unsigned char    thermopile_temp;   //热电堆测温     0-无,1-有
    /* 0x0C2 */ unsigned char    ambient_temp;      //环境温度传感器 0-无,1-有
    /* 0x0C3 */ unsigned char    env_humidity;      //环境湿度传感器 0-无,1-有
    /* 0x0C4 */ unsigned char    pm2p5;             //PM2.5传感器    0-无,1-有
    /* 0x0C5 */ unsigned char    res4[27];

    /* 0x0E0 */ unsigned char    poe;               //POE          0-无,1-有
    /* 0x0E1 */ unsigned char    touchkey_num;      //按键芯片上的按键个数 0-16
    /* 0x0E2 */ unsigned char    fp_interface;      //指纹接口     0-无,1-SPI,2-8080,3-DVP,4-MIPI,5-USB,6-UART,7-RS485,8-RS232
    /* 0x0E3 */ unsigned char    tamper;            //是否支持防拆 0-无,1-有
    /* 0x0E4 */ unsigned char    tf;                //TF卡         0-无,1-有
    /* 0x0E5 */ unsigned char    beep;              //蜂鸣器       0-无,1-有
    /* 0x0E6 */ unsigned char    qr_code;           //二维码(Quick Response Code)模组   0-无,1-有
	/* 0x0E7 */ unsigned char    mcu_type;          //mcu类型 0-ST 1-ES 2-STM
	/* 0x0E8 */ unsigned char    mic_num;           //音频输入数量,最大支持4路 0-4
	/* 0x0E9 */ unsigned char    spk_num;           //音频输出数量,最大支持4路 0-4
	/* 0x0EA */ unsigned char	 res5[22];

    /* 0x100 */ unsigned char    res6[256];
} hdb_info;
#pragma pack ()                         //取消4字节对齐方式,恢复缺省对齐

/*********************************************************************
 ******************************* DDM_light ******************************
 *********************************************************************/

/******************************* 宏定义 ******************************/
#define DDM_DEV_LIGHT_NAME              "/dev/DDM/light"
#define DDM_IOC_LIGHT_MNUM              'L'

#define DDM_LIGHT_INVALID_ARGS          (-1)      //无效值

// 氛围灯模式、颜色等设置
#define DDM_IOC_LIGHT_SET_ATMOSPHERE    _IOW(DDM_IOC_LIGHT_MNUM, 0, DDM_lightSetArgs)
// 音量灯显示数量设置
#define DDM_IOC_LIGHT_SET_VOLUME        _IOW(DDM_IOC_LIGHT_MNUM, 1, DDM_lightSetArgs)
// 报警指示灯亮灭设置
#define DDM_IOC_LIGHT_SET_ALARM         _IOW(DDM_IOC_LIGHT_MNUM, 2, DDM_lightSetArgs)
// 信息指示灯亮灭设置
#define DDM_IOC_LIGHT_SET_MESSAGE       _IOW(DDM_IOC_LIGHT_MNUM, 3, DDM_lightSetArgs)
// 红外指示灯设置,包括亮灭和频率设置
